def correct_temperature(bad_temp: float) -> float:
    # Восстанавливаем "сырое" значение. которое использовало устройство
    raw_bad = round(bad_temp * 10 + 400)
    
    # Обрезаем до 11 младших битов (макс. 2047)
    raw_true = raw_bad & 0x07FF  # эквивалентно: raw_bad % 2048

    # Проверка на недопустимое значение
    if raw_true == 0x07FF:
        return float('nan')  # или raise. или другое значение ошибки

    # Пересчитываем температуру
    return (raw_true - 400) / 10.0


a=[6552.9,
6553.2,
6551.7,
6551.9,
6551.8,
6552,
6551.9,
6551.9,
6552.2,
1.2,
1.3,
1.7,
1.4,
0.9,
6552.2,
6552.8,
6552.5,
6552.2,
6551.9,
]
for i in a:
    print(correct_temperature(i))